Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_38 (Conv2D)           (None, 222, 222, 16)      448       
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 111, 111, 16)      0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 109, 109, 16)      2320      
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 54, 54, 16)        0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 52, 52, 64)        9280      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 26, 26, 64)        0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 24, 24, 64)        36928     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 10, 10, 128)       73856     
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 5, 5, 128)         0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 3, 3, 128)         147584    
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 1, 1, 128)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_17 (Dense)             (None, 18)                2322      
=================================================================
Total params: 289,250
Trainable params: 289,250
Non-trainable params: 0
_________________________________________________________________
