BATCH_SIZE = 64 
EPOCHS = 30 
LEARNING_RATE = 0.001 
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
mobilenetv2_1.00_224 (Functi (None, 7, 7, 1280)        2257984   
_________________________________________________________________
flatten_4 (Flatten)          (None, 62720)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 18)                1128978   
=================================================================
Total params: 3,386,962
Trainable params: 3,352,850
Non-trainable params: 34,112
_________________________________________________________________
