BATCH_SIZE = 256 
EPOCHS = 30 
LEARNING_RATE = 0.005 
Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_24 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_2 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_15 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_31 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 1,332,754
Non-trainable params: 2,260,544
_________________________________________________________________
