BATCH_SIZE = 256 
EPOCHS = 50 
LEARNING_RATE = 0.0005 
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_4 (KerasLayer)   (None, 1280)              2257984   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1280)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 1024)              1311744   
_________________________________________________________________
dense_7 (Dense)              (None, 18)                18450     
=================================================================
Total params: 3,588,178
Trainable params: 1,330,194
Non-trainable params: 2,257,984
_________________________________________________________________
