BATCH_SIZE = 256 
EPOCHS = 30 
LEARNING_RATE = 0.0005 
Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_15 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
batch_normalization (BatchNo (None, 1280)              5120      
_________________________________________________________________
dropout_11 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_17 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_18 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 1,332,754
Non-trainable params: 2,260,544
_________________________________________________________________
