BATCH_SIZE = 256 
EPOCHS = 30 
LEARNING_RATE = 0.005 
TRAINABLE = True
Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_26 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_4 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_17 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_34 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_35 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 1,332,754
Non-trainable params: 2,260,544
_________________________________________________________________
