BATCH_SIZE = 20 
EPOCHS = 30 
LEARNING_RATE = 0.0005 
Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_12 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
dropout_9 (Dropout)          (None, 1280)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 18)                23058     
=================================================================
Total params: 2,281,042
Trainable params: 2,246,930
Non-trainable params: 34,112
_________________________________________________________________
