BATCH_SIZE = 350 
EPOCHS = 30 
LEARNING_RATE = 0.001 
TRAINABLE = False 
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_3 (KerasLayer)   (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_3 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_3 (Dropout)          (None, 1280)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 1024)              1311744   
_________________________________________________________________
dense_7 (Dense)              (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 1,332,754
Non-trainable params: 2,260,544
_________________________________________________________________
