BATCH_SIZE = 50 
EPOCHS = 40 
LEARNING_RATE = 0.00065 
TRAINABLE = True 
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_3 (KerasLayer)   (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_3 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_3 (Dropout)          (None, 1280)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 1024)              1311744   
_________________________________________________________________
dense_7 (Dense)              (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 3,556,626
Non-trainable params: 36,672
_________________________________________________________________
