BATCH_SIZE = 50 
EPOCHS = 5 
LEARNING_RATE = 0.01 
Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_13 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
dropout_10 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_14 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,588,178
Trainable params: 1,330,194
Non-trainable params: 2,257,984
_________________________________________________________________
