BATCH_SIZE = 256 
EPOCHS = 50 
LEARNING_RATE = 0.001 
Model: "sequential_38"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_27 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_5 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_18 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_36 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_37 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 1,332,754
Non-trainable params: 2,260,544
_________________________________________________________________
