BATCH_SIZE = 50 
EPOCHS = 30 
LEARNING_RATE = 0.001 
TRAINABLE = True 
Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_10 (KerasLayer)  (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_10 (Batc (None, 1280)              5120      
_________________________________________________________________
dropout_10 (Dropout)         (None, 1280)              0         
_________________________________________________________________
dense_20 (Dense)             (None, 1024)              1311744   
_________________________________________________________________
dense_21 (Dense)             (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 3,556,626
Non-trainable params: 36,672
_________________________________________________________________
