BATCH_SIZE = 50 
EPOCHS = 25 
LEARNING_RATE = 0.0004 
TRAINABLE = True 
Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_4 (KerasLayer)   (None, 1280)              2257984   
_________________________________________________________________
batch_normalization_4 (Batch (None, 1280)              5120      
_________________________________________________________________
dropout_4 (Dropout)          (None, 1280)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 1024)              1311744   
_________________________________________________________________
dense_9 (Dense)              (None, 18)                18450     
=================================================================
Total params: 3,593,298
Trainable params: 3,556,626
Non-trainable params: 36,672
_________________________________________________________________
